start_message = """
Привет, бро. Я Дуэйн Джонсон. Все мы любим посмеяться, поэтому я найду тебе мемчик, но только на английском.
Напиши любую тему, на которую хочешь получить мемчик."""
categories_sort_message = """
Категорию можно сменить в настройках по команде /settings.
Доступные категории: hot, new, rising, top."""
for_example_message = """
Пиши все на английском языке, ибо сайт иностранный. Пробелы в названиях заменяйте нижним подчеркиванием.
Например: cats или hollow_knight.
"""
server_is_busy = "Произошла ошибка. Подождите немного, пожалуйста, сервер перегружен"
error_message = "Произошла ошибка"
invalid_message = 'Такой команды не существует'
not_enough_parameters = """Недостаточно параметров. Использование: /meme <ключевое слово>
<категория> <фильтрация по времени>"""
invalid_parameters = """Пожалуйста, укажите ключевое слово, категория и время
Пример использования: /meme cat hot all или /meme hollow_knight hot day."""
debug_message = "Режим отладки активирован"
log_error_message = "Файл log_file.log не найден"
not_video_or_image = "Случайно выбранный пост не содержит изображения или видео мема"
daily_mem_message = "Вот ваш ежедневный мем."
planned_meme_message = """Чтобы получить мем в определенную дату и время, 
введите дату и время в формате YYYY-MM-DD HH:MM:SS"""
planned_meme_error_message = """Не верный формат даты и времени, 
пожалуйста введите дату и время в формате ГГГГ-MM-ДД ЧЧ:MM:СС"""
past_date_error_message = "Дата должна быть в будущем."
help_message = """
/start - запустить бота
/help - показать это сообщение
/planned_meme - получить мем в определенную дату и время
/settings - настройки бота
/daily_memes_stop - отписаться от ежедневной рассылки мемов
"""
incorrect_time_format = "Неверный формат времени. Пожалуйста, используйте формат ЧЧ:ММ."
stop_daily_memes_mailing_message = "Вы отписались от рассылки ежедневных мемов."
set_time_message = "Введите время в формате ЧЧ:MM для отправки ежедневных мемов:"
